In [25]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import datetime as dt
import time
import math
# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory
import matplotlib.pyplot as plt
import os
from pathlib import Path
import time
import cartopy.crs as ccrs
import sqlite3
from IPython.utils import io

df= pd.read_csv('orchid_observation.csv', index_col='id', parse_dates=['date_observed_on'])
df.dtypes

common_name                   object
scientific_name               object
latitude                     float64
longitude                    float64
date_observed_on      datetime64[ns]
place_guess                   object
place_state_name              object
place_country_name            object
dtype: object

# Working with line/cell magic

Simply loading SQL databae will not work, we first need to load external script sql

In [26]:
#loading external SQL magic
%load_ext sql
#If database is not available, it will create a database
%sql sqlite:///orchid.db
#print out tabels in the database
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.

[]

## Create table
Now we create a table with few columns, IF NOT EXISTS statement makes sure there isn't a table already present

In [27]:
%%sql
CREATE TABLE IF NOT EXISTS orchid ('common name' char, 
                     'scientific_name' char, 
                     'latitude' float, 
                     'longitutde' float );

SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.
Done.

[('orchid',)]

In [28]:
%sql SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.

[]

### Adding values
Now we add a row from *df* using <b>INSERT</b>

In [29]:
%%sql
INSERT INTO orchid VALUES
('spotted coralroot', 'Corallorhiza maculata',
 39.968807, -105.54962);
SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
1 rows affected.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.968807, -105.54962)]

We can also use python variables to insert values into a SQL table using a ':'

In [30]:
common_name = df.iloc[1].common_name
scientific_name = df.iloc[1].scientific_name
latitude = df.iloc[1].latitude
longitude = df.iloc[1].longitude
%sql INSERT INTO orchid VALUES (:common_name, :scientific_name, :latitude, :longitude);
%sql SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
1 rows affected.
 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.968807, -105.54962),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666)]

Lets use a for loop to include the rest of the rows into the table

In [31]:
#we delete all data from orchid so we can add data from csv 
#to the table
%sql DELETE FROM orchid;
%sql SELECT * FROM orchid;

#add 100 rows from from the csv to the tables
#io.capture_output supresses each print statement from sql code

for i in range(100):
    
    common_name = df.iloc[i].common_name
    scientific_name = df.iloc[i].scientific_name
    latitude = df.iloc[i].latitude
    longitude = df.iloc[i].longitude
    
    with io.capture_output(): #to stop outputs from printing
        %sql INSERT INTO orchid VALUES (:common_name, :scientific_name, :latitude, :longitude);

 * sqlite:///orchid.db
2 rows affected.
 * sqlite:///orchid.db
Done.

In [32]:
%%sql
SELECT * FROM orchid
LIMIT 5;

 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842)]

## Modify table

### Insert and Delete a new Column

We use the <b>ALTER</> command to add a new column

In [33]:
%%sql
ALTER TABLE orchid
ADD COLUMN 'private_latitude' FLOAT;

ALTER TABLE orchid
ADD COLUMN 'private_longitude' FLOAT;

SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.
Done.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204, None, None),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401, None, None),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842, None, None)]

Lets drop the newly added columns

In [34]:
%%sql
ALTER TABLE orchid
DROP COLUMN 'private_latitude';
ALTER TABLE orchid
DROP COLUMN 'private_longitude';

SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
Done.
Done.
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842)]

### Truncate
To truncate a table the SQL command **TRUNCATE** doesn't work.  Instead we use the comman **DELETE**

In [35]:
%%sql
DELETE FROM orchid;
SELECT * FROM orchid LIMIT 5

 * sqlite:///orchid.db
100 rows affected.
Done.

[]

### Change the name of a column
To change the name of a column we use the command **RENAME**

In [36]:
%%sql
ALTER TABLE orchid RENAME 'scientific_name' TO 'scientificname';
SELECT * FROM orchid

 * sqlite:///orchid.db
Done.
Done.

[]

### Delete table
Now to delete the table, and to check if the table is actually deleted.

In [38]:
%sql DROP TABLE orchid
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
(sqlite3.OperationalError) no such table: orchid
[SQL: DROP TABLE orchid]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///orchid.db
Done.

[]

# Write the CSV to sql
Uncomment the following code to write new entries to the table **orchid_full**

In [43]:
%load_ext sql
%sql sqlite:///orchid.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [45]:
%%sql
CREATE TABLE IF NOT EXISTS orchid_all ('common name' char, 
                     'scientific_name' char, 
                     'latitude' float, 
                     'longitutde' float,
                     'date_observed_on'  date,
                     'place_guess' char,
                     'place_state_name' char,
                     'place_country_name' char );
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///orchid.db
Done.
Done.

[('orchid_all',)]

In [59]:
df= pd.read_csv('orchid_observation.csv', index_col='id')
'''
%load_ext sql
%sql sqlite:///orchid.db

start_time_master = time.time()
start_time = time.time()

for i in range(len(df)):
    if i and i % 5000 == 0:
        et = time.time()-start_time_master
        m = math.floor(et/60)
        s = round(et-m*60, 2)
        
        print("number of inputs ", i, " time elapsed ", 
              m, " minutes ", s, " seconds")
        start_time = time.time()
        
    common_name = df.iloc[i].common_name
    scientific_name = df.iloc[i].scientific_name
    latitude = df.iloc[i].latitude
    longitude = df.iloc[i].longitude
    date_observed_on = df.iloc[i].date_observed_on
    place_guess = df.iloc[i].place_guess
    place_state_name = df.iloc[i].place_state_name
    place_country_name = df.iloc[i].place_country_name

    with io.capture_output(): #to stop outputs from printing
        %sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name );
    #%sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name);

elapsed_time = time.time()-start_time_master
minutes = math.floor(elapsed_time/60)
seconds = round(elapsed_time-minutes*60, 2)
print("\nit took: ", minutes, " minutes ", seconds, " seconds")

'''

'\n%load_ext sql\n%sql sqlite:///orchid.db\n\nstart_time_master = time.time()\nstart_time = time.time()\n\nfor i in range(len(df)):\n    if i and i % 5000 == 0:\n        et = time.time()-start_time_master\n        m = math.floor(et/60)\n        s = round(et-m*60, 2)\n        \n        print("number of inputs ", i, " time elapsed ", \n              m, " minutes ", s, " seconds")\n        start_time = time.time()\n        \n    common_name = df.iloc[i].common_name\n    scientific_name = df.iloc[i].scientific_name\n    latitude = df.iloc[i].latitude\n    longitude = df.iloc[i].longitude\n    date_observed_on = df.iloc[i].date_observed_on\n    place_guess = df.iloc[i].place_guess\n    place_state_name = df.iloc[i].place_state_name\n    place_country_name = df.iloc[i].place_country_name\n\n    with io.capture_output(): #to stop outputs from printing\n        %sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name );\n    #%sql INSERT INTO orchid_all VALUES (:common_name, :scientific_name, :latitude, :longitude, :date_observed_on, :place_guess, :place_state_name, :place_country_name);\n\nelapsed_time = time.time()-start_time_master\nminutes = math.floor(elapsed_time/60)\nseconds = round(elapsed_time-minutes*60, 2)\nprint("\nit took: ", minutes, " minutes ", seconds, " seconds")\n\n'

In [60]:
%%sql
SELECT * FROM orchid_all
LIMIT 5;

 * sqlite:///orchid.db
Done.

[('spotted coralroot', 'Corallorhiza maculata', 39.96880703, -105.5496204, '2017-06-28', '136 Bergren Road Nederland, CO 80466', 'Colorado', 'United States'),
 ('Tuberous Grasspink', 'Calopogon tuberosus', 45.70125048, -85.53653666, '2017-01-01', 'Beaver Island, Peaine, MI, US', 'Michigan', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 39.20595599, -77.29086307, '2017-01-01', 'Black Hill Regional Park, Boyds, MD', 'Maryland', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 37.59629696, -77.47732401, '2017-01-01', 'Northside, Richmond, VA, USA', 'Virginia', 'United States'),
 ('crane-fly orchid', 'Tipularia discolor', 35.12957887, -85.35996842, '2017-01-01', '37377, Signal Mountain, TN, US', 'Tennessee', 'United States')]